[Killed] ArrowFunction
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.js:9:31
 
 export default function UCSBDiningCommonsMenuItemCreatePage({storybook=false}) {
 
-  const objectToAxiosParams = (diningcommonsmenuitem) => ({
-    url: "/api/ucsbdiningcommonsmenuitem/post",
-    method: "POST",
-    params: {
-     diningCommonsCode: diningcommonsmenuitem.diningCommonsCode,
-     name: diningcommonsmenuitem.name,
-     station: diningcommonsmenuitem.station,
-    }
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (diningcommonsmenuitem) => {
killedBy: UCSBDiningCommonsMenuItemCreatePage tests on submit, makes request to backend, and redirects to /ucsbdiningcommonsmenuitem
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.js:11:13
 
   const objectToAxiosParams = (diningcommonsmenuitem) => ({
     url: "/api/ucsbdiningcommonsmenuitem/post",
-    method: "POST",
+    method: "",
     params: {
      diningCommonsCode: diningcommonsmenuitem.diningCommonsCode,
killedBy: UCSBDiningCommonsMenuItemCreatePage tests on submit, makes request to backend, and redirects to /ucsbdiningcommonsmenuitem
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.js:12:13
   const objectToAxiosParams = (diningcommonsmenuitem) => ({
     url: "/api/ucsbdiningcommonsmenuitem/post",
     method: "POST",
-    params: {
-     diningCommonsCode: diningcommonsmenuitem.diningCommonsCode,
-     name: diningcommonsmenuitem.name,
-     station: diningcommonsmenuitem.station,
-    }
+    params: {}
   });
 
killedBy: UCSBDiningCommonsMenuItemCreatePage tests on submit, makes request to backend, and redirects to /ucsbdiningcommonsmenuitem
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Object {
-   "diningCommonsCode": "Portolla",
-   "name": "Cream of Broccoli Soup (v)",

[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.js:19:48
     }
   });
 
-  const onSuccess = (diningcommonsmenuitem) => {
-    toast(`New dining commons menu item Created - id: ${diningcommonsmenuitem.id} name: ${diningcommonsmenuitem.name}`);
-  }
+  const onSuccess = (diningcommonsmenuitem) => {}
 
   const mutation = useBackendMutation(
killedBy: UCSBDiningCommonsMenuItemCreatePage tests on submit, makes request to backend, and redirects to /ucsbdiningcommonsmenuitem
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New dining commons menu item Created - id: 3 name: Cream of Broccoli Soup (v)"

Number of calls: 0
