[Killed] StringLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemIndexPage.js:17:35
         useBackend(
             // Stryker disable next-line all : don't test internal caching of React Query
             ["/api/ucsbdiningcommonsmenuitem/all"],
-            { method: "GET", url: "/api/ucsbdiningcommonsmenuitem/all" },
+            { method: "GET", url: "" },
             // Stryker disable next-line all : don't test default value of empty list
             []
killedBy: UCSBDiningCommonsMenuItemIndexPage tests renders three menu items correctly for regular user
statusReason: Error: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
