[Killed] ArrowFunction
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.js:24:36
             }
         );
 
-    const objectToAxiosPutParams = (ucsbDiningCommonMenuItem) => ({
-        url: "/api/ucsbdiningcommonsmenuitem",
-        method: "PUT",
-        params: {
-            id: ucsbDiningCommonMenuItem.id,
-        },
-        data: {
-            diningCommonsCode: ucsbDiningCommonMenuItem.diningCommonsCode,
-            name: ucsbDiningCommonMenuItem.name,
-            station: ucsbDiningCommonMenuItem.station
-        }
-    });
+    const objectToAxiosPutParams = () => undefined;
 
     const onSuccess = (ucsbDiningCommonMenuItem) => {
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Menu Item Updated - id: 17 name: Pizza"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2
