[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:145:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.done && 'Done is required'}
-                            {errors.done?.type === 'pattern' && 'Done must be true or false.'}
+                            {true && 'Done must be true or false.'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: RecommendationRequestForm tests No Error messages on good input
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="invalid-feedback">Done must be true or false.</div> instead
