[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestTable.js:15:36
 
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        navigate(`/recommendationRequests/edit/${cell.row.values.id}`)
-    }
+    const editCallback = (cell) => {}
 
     // Stryker disable all : hard to test for query caching
killedBy: RecommendationRequestTable tests Edit button navigates to the edit page for admin user + delete button
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/recommendationRequests/edit/1"

Number of calls: 0

<html>
  <head />
