[Killed] BlockStatement
main/pages/RecommendationRequest/RecommendationRequestIndexPage.js:3:58
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function RecommendationRequestIndexPage() {
-
-    // Stryker disable all : placeholder for future implementation
-    return (
-        <BasicLayout>
-            <div className="pt-2">
-                <h1>Index page not yet implemented</h1>
-                <p><a href="/RecommendationRequest/create">Create</a></p>
-                <p><a href="/RecommendationRequest/edit/1">Edit</a></p>
-            </div>
-        </BasicLayout>
-    )
-}
+export default function RecommendationRequestIndexPage() {}
 
killedBy: RecommendationRequestIndexPage tests Renders expected content
statusReason: Error: RecommendationRequestIndexPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
