[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:47:61
                             id="requester_email"
                             type="email"
                             isInvalid={Boolean(errors.requesterEmail)}
-                            {...register("requester_email", {
-                                required: "Requester email is required",
-                            })}
+                            {...register("requester_email", {})}
                         />
                         <Form.Control.Feedback type = "invalid" >
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Requester email is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:47:42
                             id="requester_email"
                             type="email"
                             isInvalid={Boolean(errors.requesterEmail)}
-                            {...register("requester_email", {
+                            {...register("", {
                                 required: "Requester email is required",
                             })}
killedBy: RecommendationRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] OptionalChaining
main/components/RecommendationRequest/RecommendationRequestForm.js:52:30
                             })}
                         />
                         <Form.Control.Feedback type = "invalid" >
-                            {errors.requester_email?.message }
+                            {errors.requester_email.message }
                         </Form.Control.Feedback>
 
killedBy: RecommendationRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] OptionalChaining
main/components/RecommendationRequest/RecommendationRequestForm.js:71:30
                             })}
                         />
                         <Form.Control.Feedback type = "invalid" >
-                            {errors.professor_email?.message }
+                            {errors.professor_email.message }
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: RecommendationRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:103:42
                             id="date_requested"
                             type="datetime-local"
                             isInvalid={Boolean(errors.dateRequested)}
-                            {...register("date_requested", { 
+                            {...register("", { 
                                 required: "Date requested is required." 
                             })}
killedBy: RecommendationRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] OptionalChaining
main/components/RecommendationRequest/RecommendationRequestForm.js:108:30
                             })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.date_requested?.message}
+                            {errors.date_requested.message}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: RecommendationRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:121:69
                             id="date_needed"
                             type="datetime-local"
                             isInvalid={Boolean(errors.dateNeeded)}
-                            {...register("date_needed", { required: "Date needed is required."})}
+                            {...register("date_needed", { required: ""})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Date needed is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:121:42
                             id="date_needed"
                             type="datetime-local"
                             isInvalid={Boolean(errors.dateNeeded)}
-                            {...register("date_needed", { required: "Date needed is required."})}
+                            {...register("", { required: "Date needed is required."})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] OptionalChaining
main/components/RecommendationRequest/RecommendationRequestForm.js:124:30
                             {...register("date_needed", { required: "Date needed is required."})}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.date_needed?.message}
+                            {errors.date_needed.message}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: RecommendationRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] Regex
main/components/RecommendationRequest/RecommendationRequestForm.js:139:42
                             isInvalid={Boolean(errors.done)}
                             {...register("done", {
                                 required: true,
-                                pattern: /^(true|false)$/i,
+                                pattern: /^(true|false)/i,
                             })}
                             
killedBy: RecommendationRequestForm tests done regex pattern 2
statusReason: Error: Unable to find an element with the text: /Done must be true or false./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:144:30
                             
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.done && 'Done is required'}
+                            {true}
                             {errors.done?.type === 'pattern' && 'Done must be true or false.'}
                         </Form.Control.Feedback>
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Done is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:144:30
                             
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.done && 'Done is required'}
+                            {false}
                             {errors.done?.type === 'pattern' && 'Done must be true or false.'}
                         </Form.Control.Feedback>
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Done is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestForm.js:145:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.done && 'Done is required'}
-                            {errors.done?.type === 'pattern' && 'Done must be true or false.'}
+                            {errors.done?.type === 'pattern' || 'Done must be true or false.'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Done is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:145:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.done && 'Done is required'}
-                            {errors.done?.type === 'pattern' && 'Done must be true or false.'}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Done must be true or false./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
