[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:35:9
             Header: 'id',
             accessor: 'id', // accessor is the "key" in the data
         },
-        {
-            Header: "Requester email",
-            accessor: "requester_email"
-        },
+        {},
         {
             Header: "Professor email",
killedBy: RecommendationRequestTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:36:21
             accessor: 'id', // accessor is the "key" in the data
         },
         {
-            Header: "Requester email",
+            Header: "",
             accessor: "requester_email"
         },
killedBy: RecommendationRequestTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Requester email. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:39:9
             Header: "Requester email",
             accessor: "requester_email"
         },
-        {
-            Header: "Professor email",
-            accessor: "professor_email"
-        },
+        {},
         {
             Header: "Explnation",
killedBy: RecommendationRequestTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:40:21
             accessor: "requester_email"
         },
         {
-            Header: "Professor email",
+            Header: "",
             accessor: "professor_email"
         },
killedBy: RecommendationRequestTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Professor email. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:47:9
             Header: "Explnation",
             accessor: "explanation"
         },
-        {
-            Header: "Date Requested",
-            accessor: "date_requested"
-        },
+        {},
         {
             Header: "Date Needed",
killedBy: RecommendationRequestTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!
