[Killed] BlockStatement
main/pages/RecommendationRequest/RecommendationRequestIndexPage.js:13:32
 
     const currentUser = useCurrentUser();
 
-    const createButton = () => {
-        if (hasRole(currentUser, "ROLE_ADMIN")) {
-            return (
-                <Button
-                    variant="primary"
-                    href="/recommendationrequests/create"
-                    style={{ float: "right" }}
-                >
-                    Create Recommendation Request
-                </Button>
-            )
-        }
-    }
+    const createButton = () => {}
 
     const { data: recommendationRequests, error: _error, status: _status } =
killedBy: RecommendationRequestIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: Create Recommendation Request. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrayDeclaration
main/pages/RecommendationRequest/RecommendationRequestIndexPage.js:32:13
             // Stryker disable next-line all : don't test internal caching of React Query
             ["/api/recommendationrequests/all"],
             { method: "GET", url: "/api/recommendationrequests/all" },
-            []
+            ["Stryker was here"]
         );
 
killedBy: RecommendationRequestIndexPage tests renders empty table when backend unavailable, user only
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td data-testid="RecommendationRequestTable-cell-row-0-col-id" role="cell" /> instead
