[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:5:77
 import { useForm } from 'react-hook-form'
 import { useNavigate } from 'react-router-dom'
 
-function MenuItemReviewForm ({ initialContents, submitAction, buttonLabel = "Create" }) {
+function MenuItemReviewForm ({ initialContents, submitAction, buttonLabel = "" }) {
 
     // Stryker disable all
killedBy: MenuItemReviewForm tests renders correctly
statusReason: Error: Unable to find an element with the text: /Create/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:57:64
                             id="itemId"
                             type="text"
                             isInvalid={Boolean(errors.itemId)}
-                            {...register("itemId", { required: true })}
+                            {...register("itemId", { required: false })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /Item ID is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/MenuItemReview/MenuItemReviewForm.js:76:30
                             {...register("dateReviewed", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.dateReviewed && 'Date of review is required.'}
+                            {errors.dateReviewed || 'Date of review is required.'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:76:30
                             {...register("dateReviewed", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.dateReviewed && 'Date of review is required.'}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /Date of review is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:89:63
                             id="stars"
                             type="number"
                             isInvalid={Boolean(errors.stars)}
-                            {...register("stars", { required: true, min: 1, max: 5 })}
+                            {...register("stars", { required: false, min: 1, max: 5 })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /Stars is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:89:42
                             id="stars"
                             type="number"
                             isInvalid={Boolean(errors.stars)}
-                            {...register("stars", { required: true, min: 1, max: 5 })}
+                            {...register("", { required: true, min: 1, max: 5 })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:93:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.stars && 'Stars is required.'}
-                            {errors.stars && 'Stars must be between 1 and 5.'}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Stars must be between 1 and 5./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/MenuItemReview/MenuItemReviewForm.js:93:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.stars && 'Stars is required.'}
-                            {errors.stars && 'Stars must be between 1 and 5.'}
+                            {errors.stars || 'Stars must be between 1 and 5.'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] LogicalOperator
main/components/MenuItemReview/MenuItemReviewForm.js:111:30
                             {...register("reviewerEmail", { required: true , pattern: email_regex})}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.reviewerEmail && 'Reviewer email is required.'}
+                            {errors.reviewerEmail || 'Reviewer email is required.'}
                             {errors.reviewerEmail?.type === 'pattern' && 'Reviewer email must be a valid email.'}
                         </Form.Control.Feedback>
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:111:30
                             {...register("reviewerEmail", { required: true , pattern: email_regex})}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.reviewerEmail && 'Reviewer email is required.'}
+                            {true}
                             {errors.reviewerEmail?.type === 'pattern' && 'Reviewer email must be a valid email.'}
                         </Form.Control.Feedback>
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /Reviewer email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:112:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.reviewerEmail && 'Reviewer email is required.'}
-                            {errors.reviewerEmail?.type === 'pattern' && 'Reviewer email must be a valid email.'}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Reviewer email must be a valid email./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:112:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.reviewerEmail && 'Reviewer email is required.'}
-                            {errors.reviewerEmail?.type === 'pattern' && 'Reviewer email must be a valid email.'}
+                            {true && 'Reviewer email must be a valid email.'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReviewForm tests No Error messsages on good input
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="invalid-feedback">Reviewer email must be a valid email.</div> instead

[Killed] LogicalOperator
main/components/MenuItemReview/MenuItemReviewForm.js:129:30
                             {...register("comments", {required: true})}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.comments && 'Comments are required.'}
+                            {errors.comments || 'Comments are required.'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:129:30
                             {...register("comments", {required: true})}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.comments && 'Comments are required.'}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /Comments are required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
