[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewTable.js:43:23
         },
         {
             Header: 'Stars',
-            accessor: 'stars',
+            accessor: "",
         },
         {
killedBy: MenuItemReviewTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="MenuItemReviewTable-cell-row-0-col-stars"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewTable.js:63:17
     return <OurTable
         data={menuItemReviews}
         columns={columns}
-        testid={"MenuItemReviewTable"}
+        testid={""}
     />;
 
killedBy: MenuItemReviewTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="MenuItemReviewTable-cell-row-0-col-id"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
