[Killed] BlockStatement
main/pages/MenuItemReview/MenuItemReviewIndexPage.js:3:51
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function MenuItemReviewIndexPage() {
-    
-    // Stryker disable all : placeholder for future implementation
-    return (
-    <BasicLayout>
-    <div className="pt-2">
-        <h1>Index page not yet implemented</h1>
-        <p><a href="/MenuItemReview/create">Create</a></p>
-        <p><a href="/MenuItemReview/edit/1">Edit</a></p>
-    </div>
-    </BasicLayout>
-    )
-}
+export default function MenuItemReviewIndexPage() {}
killedBy: MenuItemReviewIndexPage tests Renders expected content
statusReason: Error: MenuItemReviewIndexPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
